---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartAngle
source: html/9ba6a851-0440-6419-9963-9b19029166ca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartAngle Property

"Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartAngle { get; }
```